In [1]:
import pandas as pd

In [2]:
Nama_reptil=["Buaya",'Aligator','Ular','Kadal',"Kura-kura"]

In [3]:
ds=pd.Series(Nama_reptil)

In [4]:
ds

0        Buaya
1     Aligator
2         Ular
3        Kadal
4    Kura-kura
dtype: object

In [5]:
type(ds)

pandas.core.series.Series

In [6]:
ds=pd.Series(Nama_reptil, index=['a','b','c','d','e'])

In [7]:
ds

a        Buaya
b     Aligator
c         Ular
d        Kadal
e    Kura-kura
dtype: object

In [8]:
ds.values

array(['Buaya', 'Aligator', 'Ular', 'Kadal', 'Kura-kura'], dtype=object)

In [9]:
ds.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
ds[0]

'Buaya'

In [12]:
ds['a']

'Buaya'

In [13]:
ds[0]==ds['a']

True

In [14]:
ds[0:2]

a       Buaya
b    Aligator
dtype: object

In [15]:
ds[{'a','b'}]

b    Aligator
a       Buaya
dtype: object

In [16]:
ds[{'a','c'}]

a    Buaya
c     Ular
dtype: object

In [17]:
ds[-1]

'Kura-kura'

In [18]:
ds[-1]==ds['e']

True

In [20]:
var2={'Nama':"Brian",
     'Umur':29,
     'Kota':'Bandung'}

In [21]:
type(var2)

dict

In [22]:
cv=pd.Series(var2)

In [23]:
cv

Nama      Brian
Umur         29
Kota    Bandung
dtype: object

In [24]:
cv.index

Index(['Nama', 'Umur', 'Kota'], dtype='object')

In [25]:
cv.values

array(['Brian', 29, 'Bandung'], dtype=object)

In [26]:
cv['Nama']

'Brian'

In [29]:
print("Ganti Identitas")
for i in cv.index:
    print(i, end="=")
    cv[i]=str(input())

Ganti Identitas
Nama=Test
Umur=test
Kota=test

## Data Frame

In [30]:
Ular={'Nama':['Anaconda','Sanca','Boa','Kobra','Beluduk','Tambang'],
     'Panjang':[4.5,5,5.5,4,7,8],
     'Bobot (kg)':[15,20,27,14,40,21]}

In [31]:
type(Ular)

dict

In [32]:
len(Ular)

3

In [33]:
df=pd.DataFrame(Ular)

In [34]:
df

       Nama  Panjang  Bobot (kg)
0  Anaconda      4.5          15
1     Sanca      5.0          20
2       Boa      5.5          27
3     Kobra      4.0          14
4   Beluduk      7.0          40
5   Tambang      8.0          21

In [35]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [36]:
df.values

array([['Anaconda', 4.5, 15],
       ['Sanca', 5.0, 20],
       ['Boa', 5.5, 27],
       ['Kobra', 4.0, 14],
       ['Beluduk', 7.0, 40],
       ['Tambang', 8.0, 21]], dtype=object)

In [37]:
df.columns

Index(['Nama', 'Panjang', 'Bobot (kg)'], dtype='object')

In [38]:
df['Nama']

0    Anaconda
1       Sanca
2         Boa
3       Kobra
4     Beluduk
5     Tambang
Name: Nama, dtype: object

In [39]:
df['Bobot (kg)']

0    15
1    20
2    27
3    14
4    40
5    21
Name: Bobot (kg), dtype: int64

In [40]:
df['Nama'].loc[0]

'Anaconda'

In [41]:
df

       Nama  Panjang  Bobot (kg)
0  Anaconda      4.5          15
1     Sanca      5.0          20
2       Boa      5.5          27
3     Kobra      4.0          14
4   Beluduk      7.0          40
5   Tambang      8.0          21

In [42]:
df.loc[0]

Nama          Anaconda
Panjang            4.5
Bobot (kg)          15
Name: 0, dtype: object

In [46]:
df.loc[-1]

KeyError: -1

In [47]:
df.iloc[-1]

Nama          Tambang
Panjang           8.0
Bobot (kg)         21
Name: 5, dtype: object

## Modifikasi-tambah-hapus

In [43]:
df['Nama'].loc[0]="Laba-Laba"

C:\Users\kuman\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [44]:
df.at[0,'Nama']='Laba-Laba'

In [45]:
df

        Nama  Panjang  Bobot (kg)
0  Laba-Laba      4.5          15
1      Sanca      5.0          20
2        Boa      5.5          27
3      Kobra      4.0          14
4    Beluduk      7.0          40
5    Tambang      8.0          21

In [48]:
df.at[3,'Panjang']=10

In [49]:
df

        Nama  Panjang  Bobot (kg)
0  Laba-Laba      4.5          15
1      Sanca      5.0          20
2        Boa      5.5          27
3      Kobra     10.0          14
4    Beluduk      7.0          40
5    Tambang      8.0          21

In [50]:
df['Status Bayahay']=[5,4,3,2,5,1]

In [51]:
df

        Nama  Panjang  Bobot (kg)  Status Bayahay
0  Laba-Laba      4.5          15               5
1      Sanca      5.0          20               4
2        Boa      5.5          27               3
3      Kobra     10.0          14               2
4    Beluduk      7.0          40               5
5    Tambang      8.0          21               1

In [52]:
df.columns

Index(['Nama', 'Panjang', 'Bobot (kg)', 'Status Bayahay'], dtype='object')

In [53]:
var1={'Nama':"Kawat",
     'Panjang':10,
     'Bobot (kg)':5,
     'Status Bayahay':0}

In [54]:
type(var1)

dict

In [55]:
df=df.append(var1, ignore_index=True)

In [56]:
df

        Nama  Panjang  Bobot (kg)  Status Bayahay
0  Laba-Laba      4.5          15               5
1      Sanca      5.0          20               4
2        Boa      5.5          27               3
3      Kobra     10.0          14               2
4    Beluduk      7.0          40               5
5    Tambang      8.0          21               1
6      Kawat     10.0           5               0

### Penambahan data tanpa identitas kolom

In [57]:
var2=['Siput',3,5,1]
df.loc[len(df)]=var2

In [58]:
df

        Nama  Panjang  Bobot (kg)  Status Bayahay
0  Laba-Laba      4.5          15               5
1      Sanca      5.0          20               4
2        Boa      5.5          27               3
3      Kobra     10.0          14               2
4    Beluduk      7.0          40               5
5    Tambang      8.0          21               1
6      Kawat     10.0           5               0
7      Siput      3.0           5               1

In [59]:
len(df)

8

In [60]:
var3=['Panda',3,20,3]

In [61]:
len(df)

8

In [62]:
df

        Nama  Panjang  Bobot (kg)  Status Bayahay
0  Laba-Laba      4.5          15               5
1      Sanca      5.0          20               4
2        Boa      5.5          27               3
3      Kobra     10.0          14               2
4    Beluduk      7.0          40               5
5    Tambang      8.0          21               1
6      Kawat     10.0           5               0
7      Siput      3.0           5               1

In [63]:
df.loc[len(df)]=var3

In [64]:
df

        Nama  Panjang  Bobot (kg)  Status Bayahay
0  Laba-Laba      4.5          15               5
1      Sanca      5.0          20               4
2        Boa      5.5          27               3
3      Kobra     10.0          14               2
4    Beluduk      7.0          40               5
5    Tambang      8.0          21               1
6      Kawat     10.0           5               0
7      Siput      3.0           5               1
8      Panda      3.0          20               3

In [65]:
del df['Panjang']

In [66]:
df

        Nama  Bobot (kg)  Status Bayahay
0  Laba-Laba          15               5
1      Sanca          20               4
2        Boa          27               3
3      Kobra          14               2
4    Beluduk          40               5
5    Tambang          21               1
6      Kawat           5               0
7      Siput           5               1
8      Panda          20               3

In [68]:
df=df.drop(index=0)

In [69]:
df

      Nama  Bobot (kg)  Status Bayahay
1    Sanca          20               4
2      Boa          27               3
3    Kobra          14               2
4  Beluduk          40               5
5  Tambang          21               1
6    Kawat           5               0
7    Siput           5               1
8    Panda          20               3